/*
 * Эта программа реализует решение систем
 * уравнений линейного программирования
 * с помощью симплекс метода.
 * Задание выполнено для куросовой работы
 * Выполнил Студент Волгоградского Технологического
 * колледжа кафедры Программного обеспечения
 * вычислительной техники и автоматизированных
 * систем группы ВТ-3-1 В учебный период
 */ 

#include "get_data_from_user.h"
// #include "Simplex.h"

int main()
{
	struct _userdata ud;
	get_data_from_user(&ud);
	

//	Simplex s;
//	s.get_data_from_user();
//	s.run();

	return 0;
}
